app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by_id(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "math"], ["room_number", 3], ["created_at", "2021-07-01 20:37:09.663568"], ["updated_at", "2021-07-01 20:37:09.663568"]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Georgraphy"], ["updated_at", "2021-07-01 20:37:21.008914"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find_by_id(params[:id])
         @school_class.update(school_class_params)