app/controllers/students_controller.rb

    def edit
        @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @student = Student.find_by_id(params[:id])
         @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Frank"], ["updated_at", "2021-07-01 20:36:34.470265"], ["id", 3]]